############################################################################# ##
# Copyright (C) 2019-2020 Cameo Communications, Inc.
############################################################################# ##
#
# --------------------------------------------------------------------------
#     AUTHOR                   : EExuke
#     FILE NAME                : 2_classTest.py
#     FILE DESCRIPTION         : Python file
#     FIRST CREATION DATE      : 2020/02/12
# --------------------------------------------------------------------------
#     Version                  : 1.0
#     Last Change              : 2020/02/12
## ************************************************************************** ##
#unittest Module 中6个常用的断言方法：
# assertEqual(a, b)            核实 a == b
# assertNotEqual(a, b)         核实 a != b
# assertTrue(x)                核实 x 为True
# assertFalse(x)               核实 x 为False
# assertIn(item, list)         核实 item在list中
# assertNotIn(item, list)      核实 item不在list中
# 
#-----------------------------------------------------------
#                  MAIN PROCESS
#-----------------------------------------------------------
# 
