############################################################################# ##
# Copyright (C) 2019-2020 Cameo Communications, Inc.
############################################################################# ##
#
# --------------------------------------------------------------------------
#     AUTHOR                   : EExuke
#     FILE NAME                : 1_deffunction.py
#     FILE DESCRIPTION         : Python file
#     FIRST CREATION DATE      : 2020/02/09
# --------------------------------------------------------------------------
#     Version                  : 1.0
#     Last Change              : 2020/02/09
## ************************************************************************** ##

#-----------------------------------------------------------
#                  MAIN PROCESS
#-----------------------------------------------------------
# 8_1
def display_message() :
    """显示本章内容"""
    print("there is part8: function \n")

display_message()

#-----------------------------------------------------------
# 8_2
book = 'Linux Shell'
def favorite_book(title) :
    """喜欢的图书"""
    print("One of my favorite book is " + title +".\n")

favorite_book('Python')
favorite_book(book)

