############################################################################# ##
# Copyright (C) 2019-2020 Cameo Communications, Inc.
############################################################################# ##
#
# --------------------------------------------------------------------------
#     AUTHOR                   : EExuke
#     FILE NAME                : stdlib.py
#     FILE DESCRIPTION         : Python file
#     FIRST CREATION DATE      : 2020/02/12
# --------------------------------------------------------------------------
#     Version                  : 1.0
#     Last Change              : 2020/02/12
## ************************************************************************** ##

#-----------------------------------------------------------
#                  MAIN PROCESS
#-----------------------------------------------------------
# 9_13
# 导入标准库的排序字典类，创建有序字典
from collections import OrderedDict

dictionary = OrderedDict()

dictionary['var'] = '变量'
dictionary['if'] = '条件判断_如果'
dictionary['else'] = '条件判断_否则'
dictionary['for'] = '用于循环遍历'
dictionary['print'] = '用于打印输出'

for k, v in dictionary.items() :
    print(k + ": " + v )
